In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
      'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
      'Age': [24, 27, 22, 32, 29],
      'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
      'Salary': [45000, 54000, 50000, 62000, 47000]
  }

Create a DataFrame with the following data:

In [3]:
df = pd.DataFrame(data)

Print the first five rows of the DataFrame.

In [4]:
df.head()

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

Get the summary statistics of the 'Age' and 'Salary' columns.

In [5]:
summary = df[['Age' , 'Salary']]
summary

   Age  Salary
0   24   45000
1   27   54000
2   22   50000
3   32   62000
4   29   47000

Calculate the average salary of employees in the 'HR' department.

In [6]:
avg_salary = df[df['Department'] == 'HR']['Salary'].mean()

print("Average Salary of HR Department:", avg_salary)

Average Salary of HR Department: 46000.0

Add a new column, 'Bonus', which is 10% of the salary.

In [7]:
df['Bonus'] = df['Salary'] * 0.10

print(df)

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

Filter the DataFrame to show employees aged between 25 and 30.

In [8]:
Age_btw =df[(df['Age']>=25)&(df['Age']<=30)]
Age_btw

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

Group the data by 'Department' and calculate the average salary for each department.

In [9]:
avg_salary_by_dept = df.groupby('Department')['Salary'].mean()

print(avg_salary_by_dept)

Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

Sort the DataFrame by 'Salary' in ascending order and save the result to a new CSV file.

In [10]:
sorted_df = df.sort_values(by='Salary', ascending=True)

In [11]:
print(sorted_df)

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0

In [12]:
sorted_df.to_csv('sorted_employees.csv', index=False)

In [13]:
df = pd.read_csv('sorted_employees.csv')
print(df)

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
3      Bob   27    Finance   54000  5400.0
4    Diana   32  Marketing   62000  6200.0